<a href="https://colab.research.google.com/github/noushadkhan01/kansepur-flyash-project/blob/master/10_aug_to_11_sept_bill/kansepur_flyash_bill_10_aug_to_11_sept.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
!git clone https://github.com/noushadkhan01/kansepur-flyash-project.git

Cloning into 'kansepur-flyash-project'...
remote: Enumerating objects: 11, done.
remote: Counting objects: 100% (11/11), done.
remote: Compressing objects: 100% (11/11), done.
remote: Total 352 (delta 3), reused 0 (delta 0), pack-reused 341
Receiving objects: 100% (352/352), 799.82 KiB | 15.68 MiB/s, done.
Resolving deltas: 100% (164/164), done.

In [0]:
import pandas as pd

In [0]:
!ls

kansepur-flyash-project  sample_data

In [0]:
%cd kansepur-flyash-project/

/content/kansepur-flyash-project

In [0]:
%cd 10_aug_to_11_sept_bill

/content/kansepur-flyash-project/10_aug_to_11_sept_bill

In [0]:
!ls

'kansepur flyash bill 10 aug to 11 sept bill7.xlsx'
'kansepur flyash bill 10 aug to 11 sept.xlsx'

In [0]:
df = pd.read_excel('kansepur flyash bill 10 aug to 11 sept bill7.xlsx', 'Sheet1')
df.head()

   S.No.       Date Counts    Name  Quantity   Diesel
0    1.0 2019-08-10      1   imran     397.0   5000.0
1    2.0        NaT      2  julfan     390.0      NaN
2    3.0        NaT      3  julfan     390.0      NaN
3    4.0        NaT      4   imran     397.0      NaN
4    5.0 2019-08-11      1   imran     397.0  13000.0

In [0]:
df.tail(2)

     S.No. Date               Counts Name   Quantity  Diesel
312    NaN  NaT  Amount = Qty * 4.25  NaN  519906.75     NaN
313    NaN  NaT  Balance = amt - dsl  NaN  217906.75     NaN

In [0]:
maap = {'imran':397, 'julfan':390, 'gulfam':411, 'saddam': 465, 'khurseed': 391, 'jabir': 416, 
        'akram': 360, 'wajid': 357, 'kayum': 308, 'bhura': 397, 'zishan': 484, 'amjad':397, 'rasid':406
        }

In [0]:
df = df[:-1]

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 313 entries, 0 to 312
Data columns (total 6 columns):
S.No.       311 non-null float64
Date        19 non-null datetime64[ns]
Counts      313 non-null object
Name        311 non-null object
Quantity    313 non-null float64
Diesel      20 non-null float64
dtypes: datetime64[ns](1), float64(3), object(2)
memory usage: 14.8+ KB

##fill values

In [0]:
df.columns

Index(['S.No.', 'Date', 'Counts', 'Name', 'Quantity', 'Diesel'], dtype='object')

def fill_quantity(a):
  name, qty = a
  if pd.isnull(qty):
    return maap.get(name)
  return qty

df['Quantity'] = df[['Name', 'Quantity']].apply(fill_quantity, axis = 1)

In [0]:
df.Quantity[:3]

0    397.0
1    390.0
2    390.0
Name: Quantity, dtype: float64

In [0]:
df.Quantity.isnull().sum()

0

df.to_excel('my_excel2.xlsx', index = False)

from google.colab import files

files.download('my_excel2.xlsx')

In [0]:
unique_dates = df.Date.unique()
unique_dates = pd.Series(unique_dates).dropna()
print(unique_dates)

0    2019-08-10
2    2019-08-11
3    2019-08-22
4    2019-08-23
5    2019-08-24
6    2019-08-25
7    2019-08-28
8    2019-08-29
9    2019-09-01
10   2019-09-02
11   2019-09-03
12   2019-09-04
13   2019-09-05
14   2019-09-06
15   2019-09-07
16   2019-09-08
17   2019-09-09
18   2019-09-10
19   2019-09-11
dtype: datetime64[ns]

In [0]:
df.Date.nunique()

19

In [0]:
df.Date.value_counts()

2019-08-29    1
2019-09-08    1
2019-08-23    1
2019-09-06    1
2019-09-03    1
2019-08-28    1
2019-09-11    1
2019-08-11    1
2019-08-25    1
2019-08-22    1
2019-09-01    1
2019-09-05    1
2019-09-02    1
2019-09-10    1
2019-08-10    1
2019-08-24    1
2019-09-07    1
2019-09-04    1
2019-09-09    1
Name: Date, dtype: int64

In [0]:
import numpy as np

In [0]:
df.Name.unique()

array(['imran', 'julfan', 'gulfam', 'khurseed', 'saddam', 'jabir',
       'amjad', 'kayum', 'akram', 'bhura', 'wajid', 'mehmood', 'rasid',
       'zishan', nan], dtype=object)

In [0]:
total_quantity = sum(df.Quantity)
total_quantity

764568.75

In [0]:
rounds_per_name = df.Name.value_counts()
rounds_per_name

imran       47
gulfam      35
khurseed    32
saddam      32
akram       29
kayum       24
julfan      24
bhura       24
wajid       22
jabir       19
rasid       13
zishan       4
mehmood      3
amjad        3
Name: Name, dtype: int64

In [0]:
sum(rounds_per_name.values)

311

## unique feets per name

In [0]:
group = df.groupby(df.Name)
group

for i, j in group:
  print(i, '\n', j.Quantity, '\n')

In [0]:
for i, j in group:
  print(i, j.Quantity.unique(), '\n')

akram [360.]

amjad [397.]

bhura [397.]

gulfam [411.]

imran [397.]

jabir [416.]

julfan [390.]

kayum [308.]

khurseed [391. 341.]

mehmood [308. 357. 397.]

rasid [406.]

saddam [465.]

wajid [357.]

zishan [484.]

# Diesel

In [0]:
diesel = pd.read_excel('kansepur flyash bill 10 aug to 11 sept bill7.xlsx', 'Diesel')
diesel.head()

        Date       Name  Diesel   Cash  bharai
0 2019-08-09     julfan       0    NaN   250.0
1        NaT      imran       0    NaN   250.0
2 2019-08-10      imran    1500  500.0     NaN
3        NaT     julfan    1500    NaN     NaN
4        NaT  vakil_jcb    2000    NaN     NaN

In [0]:
diesel.shape

(180, 5)

In [0]:
diesel.Date.unique()

array(['2019-08-09T00:00:00.000000000',                           'NaT',
       '2019-08-10T00:00:00.000000000', '2019-08-11T00:00:00.000000000',
       '2019-08-22T00:00:00.000000000', '2019-08-23T00:00:00.000000000',
       '2019-08-24T00:00:00.000000000', '2019-08-25T00:00:00.000000000',
       '2019-08-28T00:00:00.000000000', '2019-08-29T00:00:00.000000000',
       '2019-09-01T00:00:00.000000000', '2019-09-02T00:00:00.000000000',
       '2019-09-03T00:00:00.000000000', '2019-09-04T00:00:00.000000000',
       '2019-09-05T00:00:00.000000000', '2019-09-06T00:00:00.000000000',
       '2019-09-07T00:00:00.000000000', '2019-09-08T00:00:00.000000000',
       '2019-09-09T00:00:00.000000000', '2019-09-10T00:00:00.000000000',
       '2019-09-11T00:00:00.000000000'], dtype='datetime64[ns]')

In [0]:
for n, i in enumerate(diesel.Date.values):
  if not pd.isnull(i):
    date = i
  else:
    diesel.iloc[n, 0] = date

In [0]:
diesel.head()

        Date       Name  Diesel   Cash  bharai
0 2019-08-09     julfan       0    NaN   250.0
1 2019-08-09      imran       0    NaN   250.0
2 2019-08-10      imran    1500  500.0     NaN
3 2019-08-10     julfan    1500    NaN     NaN
4 2019-08-10  vakil_jcb    2000    NaN     NaN

# pivot table

In [0]:
pivot_diesel = diesel.pivot_table(index = 'Name', columns = 'Date', values = 'Diesel')
pivot_diesel

Date       2019-08-09  2019-08-10  ...  2019-09-10  2019-09-11
Name                               ...
akram             NaN         NaN  ...      2000.0      2000.0
amjad             NaN         NaN  ...         NaN         NaN
bhada jcb         NaN         NaN  ...         NaN         NaN
bhura             NaN         NaN  ...      2000.0      2000.0
car               NaN         NaN  ...         NaN         NaN
cash              NaN         NaN  ...      2000.0      2000.0
gulfam            NaN         NaN  ...      2000.0      2000.0
imran             0.0      1500.0  ...      2000.0      2000.0
jabir             NaN         NaN  ...      2000.0         NaN
julfan            0.0      1500.0  ...      2000.0         0.0
kayum             NaN         NaN  ...         NaN      2000.0
khurseed          NaN         NaN  ...      2000.0      2000.0
rasid             NaN         NaN  ...         NaN      2000.0
sabir jcb         NaN         NaN  ...         NaN         NaN
saddam            NaN         NaN  ...      2000.0         NaN
total             NaN      5000.0  ...     23000.0     23000.0
vakil_jcb         NaN      2000.0  ...      3000.0      3000.0
wajid             NaN         NaN  ...         0.0      2000.0
zishan            NaN         NaN  ...      2000.0      2000.0

[19 rows x 20 columns]

In [0]:
pivot_diesel.fillna(value = 0, inplace = True)

In [0]:
pivot_diesel.head(2)

Date   2019-08-09  2019-08-10  2019-08-11  ...  2019-09-09  2019-09-10  2019-09-11
Name                                       ...
akram         0.0         0.0         0.0  ...         0.0      2000.0      2000.0
amjad         0.0         0.0         0.0  ...         0.0         0.0         0.0

[2 rows x 20 columns]

In [0]:
pivot_diesel['Total Diesel'] = pd.Series([0 for i in range(len(pivot_diesel))])
pivot_diesel.head(1)

Date   2019-08-09 00:00:00  ...  Total Diesel
Name                        ...
akram                  0.0  ...           NaN

[1 rows x 21 columns]

In [0]:
for i in range(len(pivot_diesel)):
  pivot_diesel['Total Diesel'][i] = sum(pivot_diesel.iloc[i, 0:-1])

In [0]:
pivot_diesel

Date       2019-08-09 00:00:00  ...  Total Diesel
Name                            ...
akram                      0.0  ...       15000.0
amjad                      0.0  ...        4000.0
bhada jcb                  0.0  ...       12000.0
bhura                      0.0  ...       18000.0
car                        0.0  ...        1000.0
cash                       0.0  ...       39500.0
gulfam                     0.0  ...       22500.0
imran                      0.0  ...       29500.0
jabir                      0.0  ...        9000.0
julfan                     0.0  ...       16000.0
kayum                      0.0  ...       14500.0
khurseed                   0.0  ...       25500.0
rasid                      0.0  ...        8000.0
sabir jcb                  0.0  ...        2250.0
saddam                     0.0  ...       22000.0
total                      0.0  ...      300000.0
vakil_jcb                  0.0  ...       45000.0
wajid                      0.0  ...       11000.0
zishan                     0.0  ...        4000.0

[19 rows x 21 columns]

In [0]:
diesel = pivot_diesel[['Total Diesel']]
diesel

Date       Total Diesel
Name
akram           15000.0
amjad            4000.0
bhada jcb       12000.0
bhura           18000.0
car              1000.0
cash            39500.0
gulfam          22500.0
imran           29500.0
jabir            9000.0
julfan          16000.0
kayum           14500.0
khurseed        25500.0
rasid            8000.0
sabir jcb        2250.0
saddam          22000.0
total          300000.0
vakil_jcb       45000.0
wajid           11000.0
zishan           4000.0

# Total Quantity per name

In [0]:
name_groups = df.groupby('Name')
name_total_quantity = pd.DataFrame(columns = ['Name', 'Total Quantity'])
for i, j in name_groups:
  name_total_quantity = name_total_quantity.append({'Name':i, 'Total Quantity': sum(j.Quantity)}, ignore_index = True)
  
name_total_quantity.sort_values(by = ['Total Quantity'], ascending = False, inplace = True)

In [0]:
name_total_quantity

        Name  Total Quantity
4      imran         18659.0
11    saddam         14880.0
3     gulfam         14385.0
8   khurseed         12462.0
0      akram         10440.0
2      bhura          9528.0
6     julfan          9360.0
5      jabir          7904.0
12     wajid          7854.0
7      kayum          7392.0
10     rasid          5278.0
13    zishan          1936.0
1      amjad          1191.0
9    mehmood          1062.0

In [0]:
diesel.reset_index(inplace = True)

In [0]:
diesel.head(1)

Date   Name  Total Diesel
0     akram       15000.0

In [0]:
name_total_quantity.shape

(14, 2)

In [0]:
diesel.shape

(19, 2)

In [0]:
names = name_total_quantity.Name.values
names

array(['imran', 'saddam', 'gulfam', 'khurseed', 'akram', 'bhura',
       'julfan', 'jabir', 'wajid', 'kayum', 'rasid', 'zishan', 'amjad',
       'mehmood'], dtype=object)

In [0]:
final = pd.DataFrame(columns = ['Name','Counts' , 'Total Quantity', 'Amount', 'Diesel', 'Amount - Diesel'])
for i in names:
    total_quantity = name_total_quantity[name_total_quantity.Name == i]['Total Quantity'].values[0]
    if i in diesel.Name.values:
      total_diesel = diesel[diesel.Name == i]['Total Diesel'].values[0]
    else:
      total_diesel = 0
    final = final.append({'Name': i,'Total Quantity':total_quantity,
                            'Counts':rounds_per_name.get(i),
                            'Amount':total_quantity*3,
                            'Diesel':total_diesel,
                            'Amount - Diesel':total_quantity*3 - total_diesel},
                           ignore_index = True)

In [0]:
final.sort_values(by = 'Total Quantity', ascending = False, inplace = True)
final

        Name Counts  Total Quantity   Amount   Diesel  Amount - Diesel
0      imran     47         18659.0  55977.0  29500.0          26477.0
1     saddam     32         14880.0  44640.0  22000.0          22640.0
2     gulfam     35         14385.0  43155.0  22500.0          20655.0
3   khurseed     32         12462.0  37386.0  25500.0          11886.0
4      akram     29         10440.0  31320.0  15000.0          16320.0
5      bhura     24          9528.0  28584.0  18000.0          10584.0
6     julfan     24          9360.0  28080.0  16000.0          12080.0
7      jabir     19          7904.0  23712.0   9000.0          14712.0
8      wajid     22          7854.0  23562.0  11000.0          12562.0
9      kayum     24          7392.0  22176.0  14500.0           7676.0
10     rasid     13          5278.0  15834.0   8000.0           7834.0
11    zishan      4          1936.0   5808.0   4000.0           1808.0
12     amjad      3          1191.0   3573.0   4000.0           -427.0
13   mehmood      3          1062.0   3186.0      0.0           3186.0

In [0]:
final.append({'Name': 'Total', 'Counts': sum(final.Counts), 'Total Quantity':sum(final['Total Quantity']),	'Amount':sum(final.Amount),
              'Diesel':sum(final.Diesel), 'Amount - Diesel':sum(final['Amount - Diesel'])}, ignore_index = True)

        Name Counts  Total Quantity    Amount    Diesel  Amount - Diesel
0      imran     47         18659.0   55977.0   29500.0          26477.0
1     saddam     32         14880.0   44640.0   22000.0          22640.0
2     gulfam     35         14385.0   43155.0   22500.0          20655.0
3   khurseed     32         12462.0   37386.0   25500.0          11886.0
4      akram     29         10440.0   31320.0   15000.0          16320.0
5      bhura     24          9528.0   28584.0   18000.0          10584.0
6     julfan     24          9360.0   28080.0   16000.0          12080.0
7      jabir     19          7904.0   23712.0    9000.0          14712.0
8      wajid     22          7854.0   23562.0   11000.0          12562.0
9      kayum     24          7392.0   22176.0   14500.0           7676.0
10     rasid     13          5278.0   15834.0    8000.0           7834.0
11    zishan      4          1936.0    5808.0    4000.0           1808.0
12     amjad      3          1191.0    3573.0    4000.0           -427.0
13   mehmood      3          1062.0    3186.0       0.0           3186.0
14     Total    311        122331.0  366993.0  199000.0         167993.0

In [0]:
final.shape

(14, 6)

In [0]:
final.sum(axis = 0, skipna = True)

Name               imransaddamgulfamkhurseedakrambhurajulfanjabir...
Counts                                                           311
Total Quantity                                                122331
Amount                                                        366993
Diesel                                                        199000
Amount - Diesel                                               167993
dtype: object

In [0]:
total_q = sum(final['Total Quantity'])
total_q

122331.0

# Total payable

In [0]:
our_amount = total_quantity*4.25
our_amount

4513.5

In [0]:
total_diesel

0

In [0]:
sabir_jcb = pivot_diesel.loc['sabir jcb']['Total Diesel']
sabir_jcb

2250.0

# Our Balance

In [0]:
balance = our_amount - total_diesel
balance

4513.5

# Tot to People

In [0]:
to_people = total_quantity*3
to_people

3186.0